restful/myapp/app/Controllers/Billing.php

SELECT *
FROM `billing`
WHERE `invoice_id` = '1'
SELECT *
FROM `billing_details`
WHERE `invoice_id` = '1'
---
    public function invoice()
    {
        $id = $this->request->uri->getSegment(2);

        //get a query builder instance for the invoice with the id
        $builder = $this->db->table('billing')->where('invoice_id', $id);

        $response  = array(
            'error' => false,
            'message' => 'record loaded successfully',
            'invoice' => $builder->get()->getRowArray()
        );

        if( !$response['invoice'] ){
            return $this->response->setStatusCode(400)->setJSON(array('error' => true, 'message' => 'Invalid invoice id', 'invoice' => null));
        }

        //reset query
        $builder->resetQuery();

        // get invoice details
        $builder = $this->db->table('billing_details')->where('invoice_id', $id);
        $response['invoice']['details'] = $builder->get()->getResultArray();