restful/myapp/app/Controllers/Customers.php

        //check that email is unique before inserting in database
        $customer = $this->customerModel->set_data($data);

        $response = $customer->insert_customer();
---
INSERT INTO `customers` (`name`, `email`) VALUES ('Benito', 'benito@gmail.com')