restful/myapp/app/Models/Customer_model.php

SELECT *
FROM `customers`
WHERE `id` = '205'
AND `status` = 'active'
---
    public function get_customer( $id){

        $builder = $this->db->table($this->table);
        $builder->where('id', $id);
        $builder->where('status', 'active');

        $query = $builder->get();

SELECT *
FROM `customers`
WHERE `email` = 'benito@gmail.com'
INSERT INTO `customers` (`name`, `active`, `email`, `zip`, `phone1`, `phone2`, `country`, `address`) VALUES ('BENITO', 1, 'benito@gmail.com', NULL, NULL, NULL, NULL, NULL)
---
    public function insert_customer(){

        //Verify the email is unique

        $customer_email = $this->db->table('customers')->where('email', $this->email)->get()->getRowArray();
        // return $customer_email;

        if( $customer_email !== null ){
            //return this error if email already exists
            return array('error' => true, 'message' => 'Email already exists', 'customer' => null);
        }

        //validate the data
        // $customer = $this->customerModel->set_data($data);

        //if email is unique, insert in database
        $completed = $this->db->table('customers')->insert($this);

SELECT *
FROM `customers`
WHERE `email` = 'mimi@gmail.com'
AND `id` != '205'
UPDATE `customers` SET `id` = '205', `name` = 'MIMI', `active` = 1, `email` = 'mimi@gmail.com', `zip` = NULL, `phone1` = NULL, `phone2` = NULL, `country` = NULL, `address` = NULL
WHERE `id` = '205'
---
    public function update_customer(){

        //Verify the email is unique
        $customer_email = $this->db->table('customers')->where('email', $this->email)->where('id !=', $this->id)->get()->getRowArray();
        // return $customer_email;

        if( $customer_email !== null ){
            //return this error if email already exists
            return array('error' => true, 'message' => 'Email already exists', 'customer' => null);
        }


        //if email is unique, insert in database
        // echo json_encode($this);
        $completed = $this->db->table('customers')->where('id', $this->id)->update($this);

UPDATE `customers` SET `status` = 'inactive'
WHERE `id` = '205'
---
    public function delete_customer( $customer_id ){

        $builder = $this->db->table($this->table);
        $builder->where('id', $customer_id);

        $completed = $builder->set('status', 'inactive')->update();